Вы загадали натуральное число ﻿nn﻿ и решили заполнить квадратную таблицу размером ﻿n \times nn×n﻿ буквами по «диагональному правилу» — клетки, находящиеся на двух самых длинных диагоналях, должны содержать символ «﻿aa﻿». Пустые клетки, соседние с «﻿aa﻿»-клетками, нужно заполнить символом «﻿bb﻿», и так далее по алфавиту. Когда придет время заполнять соседей «﻿zz﻿»-клеток, в них нужно записать символ «﻿aa﻿». После этого незаполненными соседями «a»-клеток вновь становятся «b» и так далее. Напишите программу, которая выведет получившуюся таблицу.



    Формат входных данных

Входные данные содержат одно целое число ﻿nn﻿ (﻿1 ≤ n ≤ 1001≤n≤100﻿) — высоту и ширину таблицы.



    Формат выходных данных

Выведите ﻿nn﻿ строк по ﻿nn﻿ символов — таблицу, заполненную по диагональному правилу.